---
type: RebarContainerIterator
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 6
tags: [revit-api, class]
---

# RebarContainerIterator

`Autodesk.Revit.DB.Structure.RebarContainerIterator` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | MoveNext | 2016 | `public virtual bool MoveNext ()` |
| Method | Reset | 2016 | `public virtual void Reset ()` |
| Property | Current | — | `public virtual RebarContainerItem Current { get ; }` |
| Property | CurrentObject | — | `internal Object CurrentObject { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |